## Урок 4. Основы функционального программирования

### Функции
Функция - это некий блок кода, который мы можем объявить и вызывать в тех местах, где нам требуется выполнить этот блок кода.  
Функция может принимать некие аргументы, производить вычисления и выдавать некие рузельтаты.  
Функции в Python - этот составные инструкции, которые могут принимать данные ввода, выполнять указания и возвращать данные вывода.  
Вызвать функцию - значит передать ей входные данные, необходимые для выполнения и возвращения результата.  
Входные данные в функциях называются аргументами функции.  
Обычны функция определяется с помощью инстркции def.  
Синтаксис: 

    def имя_функции(параметры):
        определение_функции

### Аргументы функции
Аргументы бывают 2-х видов:
1. Обязательные 
2. Не обязательные

Не обязательные аргументы имеют строгую типизацию (можно передавать только те типы данных, которые указали) - Иначе: ошибка

### Задача №1
Напишите функцию, принимающую 1 аргумент - сторону квадрата, и возвращающую 2 значения (с помощью кортежа): периментр квадрата и площадь квадрата.

### Решение задачи №1
    def task(x):
        return x*4, x**2


    print(task(5))  # (20, 25)

### Конструкция *args
Иногда нужны более гибкие функции, которые работают с неизвестным количеством аргументов.  
Для этого есть специальная конструкция, она упаковывает позиционные аргументы в переменную.  
(используем, когда не знаем сколько аргументов будет применимать функция)

Синтаксис: 

    def function(*args):  # args - это не зарезервированное слово. Можем использовать любое слово, которое подходит по смыслу. 
        
### Конструкция **kwargs
Позволяет получать все именованные аргументы функции.

### Функции и области видимости
Область видимости разрешает конфликт имён и гарантирует, что любой объект, созданный внутри функции, не перезапишет предыдущий объект с таким же именем без явного указания.
- Глобальная область видимости - изначально (все переменные достпуны из любой части программы)
- Локальная область видимости - когда объявили какие-то функции (внутри них)
  - Внутри функций можно создавать временные переменные для вычислений. Чтобы измебжать конфликта имён и случайной перезаписи, под каждую функцию.

### Lambda-функции
Одна из интересных особенностей Python - это анонимные функции.  
Это простое выражение, которое можно присвоить переменной и использовать повторно.  
Lambda-функция - это безымянная однострочная функция, которая выполняет одно какое-то выражение. 

Синтаксис, в таком случае, будет такой:

    lambda аргументы: выражение

Пример:

    double = lambda x: x*2
    print(double(5))

Это функция может иметь любое количество аргументов, но вычисляет и возвращает только одно значение.  
Синтаксически лямбда-функция ограничена, позволяет представить всего одно выражение.  
Чаще всего лямбда-функции используют вместе с такими встроенными функциями как filter(), map() и другие.

### Функция filter()
Функция filter() - это глобальная функция, которая доступна в любом месте кода.  
Функция filter() в Python принимает в качестве аргументов функцию и список.  
Функция вызывается со всеми элементами в списке, и в результате возвращает элементы, для которых функция вернула True.   
Функция filter() возвращает свой собственный тип данных. Но он спокойно конвертируется в обычные типы (список либо кортеж). 

Пример: 

    list_values = (1, 3, 4, 2, 6, 7, 5, 8, 9)
    print(list (filter(lambda x: x % 2 == 0, list_values)))

### Задача №2
Имеется строка, состоящая из нескольких слов.  
Напишите фильтр, который возвращает список из букв строки, за исключением пробелов.

### Решение задачи №3
    my_str = 'lambda expressions'

    print(list(filter(lambda x: x != ' ', my_str)))