## Урок 2.  Конструкции языка - часть 1

### Метод slice
Метод slice - это способ, используемый для] прдставления некоторой части последовательности.  
Применятеся в основном для строк, списков и кортежей.

Файл с примерами: slice.py

    slice

    str[start: stop: step]
    list[start: stop: step]

    my_str = 'programmer'
    print (my_str[0:7])  # program 
    print (my_str[:7])  # program 
    print (my_str[:-3])  # program

    print (my_str[0:7:2]) # porm

    my_list = [1, 2, 3, 4, 5, 6, 7, 8] 
    print(my_list[:2])  # [1, 2] 
    print(my_list[3:6])  # [4, 5, 6]

    print(my_list[::2])  # [1, 3, 5, 7]

### Приведение типов.
Приведение типов - это процесс преобразования значения одного типа данных в другой.  
В Python есть два вида преобразования: 
1. Неявное преобразование типов.
2. Явное приведение типов. 

#### Неявное преобразование типов.
При неявном преобразовании участие программиста не трубется, python автоматически изменяет тип данных.  
Например, при делении целого чила можно получить дробь.

Файл с примерами: implicit_types.py


    #  Неявное Преобразование типов
    a = 5
    type (a)  # int

    a = a / 2
    type (a)  # float

    my_str = '123'
    my_int = 123
    print (my_str + my_int)  # Ошибка, так как Python не понимает, что нужно сделать с этими типам данных

#### Явное привидение типов.
В явном преобразовании программист сам заменяет ткущий тип данных объекта на требуемый.  
Для этого используются встроенные функции.

Файл с примерами: explicit_types.py


    # Явное Преобразование типов
    my_str = '123'
    my_int = 123

    print(type (my_int))
    print(type (my_str))

    my_str = int(my_str)
    print("Тип данных в my_str после приведения:", type(my_str))

    # Примеры
    print(int('55'))  # 55
    # print(int('55.5'))  # Error
    print (float('55.5'))  # 55.5
    # print(int('1a2b3c'))  # Error


    print(str(55.5))  # "55.5" 
    print(str([1, 2, 3]))  # "[1, 2, 3]"

    x = '.join(['1', '2', '3']) 
    print('x = ', x)  # x = 1 2 3 
    print('type (x)', type (x))  # type (x) <class 'str'>

    print(list("123"))  # ['1', '2', '3'] 
    print(list("1 2 3"))  # ['1', ' ', '2', ' ', '3']

    print("1,2,3".split())  # [1,2,3] 
    print("1 2 3".split())  # ['1', '2', '3']
    print("1,2,3".split(','))  # ['1', '2', '3']

### Конструкция if else.

Конструкция if else
Иногда нужно, чтобы кусок кода выполнялся только при выполнении определенного условия.  
Для этого нужно уметь оценивать условия.  
Чтобы на основе оценки определенного выражения можно было принять решение, выполнять определенный код или нет, в Python существует условный оператор if...elif...else.

Файл с примерами: if.py

    num = 3
    if num > 0:
        print('Число положительное')

    if isinstance (num, int): 
        print("Число целое")

    if num != 3:
        print('число не равно 3')
    else:    
        print('число равно 3')

    my_list = []

    if my_list:
        print('в списке есть значения')
    else:    
        print('в списке нет значений')

    # if elif
    if num > 0:
        print('Число положительное')
    elif num == 0:
        print("Число == 0)
    else:
       print('Число отрицательное')


    # Составные условия 
    permit = True 
    my fint = 5.5

    if permit and my_int > 0: 
        print('Число положительное")

    if permit or my_int > 0: 
        print('Число положительное')

    permit = False
    if not permit and my_int > 0:
        print('Число положительное')


    my_list = [1, 2, 3, 4] 
    if 1 in my list: 
        print('1 есть в списке')

### Задача № 1
Напишите программу, которая отвечает "ДА" или "НЕТ" на следующий вопрос:

    # str_2 содержит в себе str_1 ?
    str_1 = 'test'
    str_2 = 'test1'

### Решение задачи № 1
    def task_1():
        if str_1 in str_2:
            print('ДА')
        else:
            print('НЕТ')
        
    task_1()

### Конструкция try except.

Исключения (exceptions) - ещё один тип данных в python. Исключения необходимы для того, чтобы сообщать программисту об ошибках.  
При возникновении ошибки в программе вызывается исключение.  
Исключения можно вызывать самостоятельно с помощью ключевого слова **raise**.  
Также можно отлавливать с помощью конструкции **try except**.  

Файл с примерами: exceptions.py

    # Пример исключения
    print('123' + 123)  # Error

    # Создание исключения
    m = 1
    if not m:
        raise Exception('Переменная m - пустая')

    try: 
        if not m:    
            raise Exception('Переменная пустая")
    
    except Exception as e:
        print(f'Зафиксированно исключение "{e}"')


### Словари - тип данных (dict)
Словари - это неупорядоченные коллекции произвольных объектов с доступом по ключу.  
Пример словаря:

    d = {'a': 1, 'b': 2, 'c': 3}
Создать словарь можно несколькими способами
1. Запись в переменную
2. через dict()
3. через fromkeys

Файл с примерами: dict.py


    # 1-й способ создания - запись 
    d = f'a': 1, 'b': 2, 'c': 3}
    
    # 2-й способ создания через dict 
    d_2 = dict(a=1, b=2, с=3)
    print(d_2)  # {'a': 1, 'b': 2, 'c': 3}

    # 3-й способ создания - через fromkeys 
    d_2 = dict.fromkeys(['a', 'b', 'c'], 3) 
    print(d_2)  # {'a': 3, 'b': 3, 'c': 3}


    @new_dict = {
        'name': 'userName",
        'info': {
        'age': 0,
        }
    }

    # Доступ к элементу словаря
    print(d['a']) 
    print(d['b'])

    # Добавление новых элементов в словарь
    print(d) 
    d['d'] = 4 
    print(d)

    # print(d['eee'])  # KeyError

    print(new_dict['info']['age'])


    # Методы словарей
    my_d = dict.fromkeys(['a', 'b', 'c'], 0)

    my_d_2 = my_d.copy()  # возвращает копию словаря.

    my_d.clear() # очищает словарь.

    print(my_d_2.items())  # возвращает пары (ключ, значение). - [('a', 0), ('b', 0), ('c', 0)] 
    print (my_d_2.keys())  # возврашает клчи - ['a', 'b', 'c']